Backend/app/models/team.rb

  def player_quantity
    SoccerPlayer.where(team_id: id).count
---
SELECT COUNT(*) FROM "soccer_players" WHERE "soccer_players"."team_id" = ?  [["team_id", 1]]