Backend/app/controllers/matches_controller.rb

INSERT INTO "matches" ("team_house_id", "team_outside_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["team_house_id", 2], ["team_outside_id", 3], ["created_at", "2023-12-02 23:49:25.659972"], ["updated_at", "2023-12-02 23:49:25.659972"]]
---
  def create
    @match = Match.new(match_params)

    respond_to do |format|
      if @match.save