Backend/app/controllers/soccer_players_controller.rb

  def create
    @soccer_player = SoccerPlayer.new(soccer_player_params)

    respond_to do |format|
      if @soccer_player.save
---
INSERT INTO "soccer_players" ("name", "number", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Ronaldo"], ["number", 9], ["team_id", 1], ["created_at", "2023-12-02 23:16:41.926836"], ["updated_at", "2023-12-02 23:16:41.926836"]]

  def update
    respond_to do |format|
      if @soccer_player.update(soccer_player_params)
---
UPDATE "soccer_players" SET "team_id" = ?, "updated_at" = ? WHERE "soccer_players"."id" = ?  [["team_id", 2], ["updated_at", "2023-12-02 23:24:26.599980"], ["id", 1]]

    def set_soccer_player
      @soccer_player = SoccerPlayer.find(params[:id])
---
SELECT "soccer_players".* FROM "soccer_players" WHERE "soccer_players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]