Backend/app/controllers/teams_controller.rb

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO "teams" ("name", "victories", "loses", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Brasil"], ["victories", 4], ["loses", 2], ["created_at", "2023-12-02 22:13:36.922336"], ["updated_at", "2023-12-02 22:13:36.922336"]]